In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns 
from math import sqrt
%matplotlib inline
import warnings
warnings.filterwarnings('ignore')

In [22]:
df1 = pd.read_csv('exercise.csv')

In [23]:
df1.head()

    User_ID  Gender  Age  Height  Weight  Duration  Heart_Rate  Body_Temp
0  14733363    male   68   190.0    94.0      29.0       105.0       40.8
1  14861698  female   20   166.0    60.0      14.0        94.0       40.3
2  11179863    male   69   179.0    79.0       5.0        88.0       38.7
3  16180408  female   34   179.0    71.0      13.0       100.0       40.5
4  17771927  female   27   154.0    58.0      10.0        81.0       39.8

In [24]:
df2 = pd.read_csv('calories (1).csv')

In [25]:
df2.head()

    User_ID  Calories
0  14733363     231.0
1  14861698      66.0
2  11179863      26.0
3  16180408      71.0
4  17771927      35.0

In [26]:
df = pd.concat([df1,df2],axis=1)

In [27]:
df.head()

,User_ID,Gender,Age,Height,Weight,Duration,Heart_Rate,Body_Temp,User_ID,Calories
0,14733363,male,68,190.0,94.0,29.0,105.0,40.8,14733363,231.0
1,14861698,female,20,166.0,60.0,14.0,94.0,40.3,14861698,66.0
2,11179863,male,69,179.0,79.0,5.0,88.0,38.7,11179863,26.0
3,16180408,female,34,179.0,71.0,13.0,100.0,40.5,16180408,71.0
4,17771927,female,27,154.0,58.0,10.0,81.0,39.8,17771927,35.0

In [28]:
df.isnull().sum()

User_ID       0
Gender        0
Age           0
Height        0
Weight        0
Duration      0
Heart_Rate    0
Body_Temp     0
User_ID       0
Calories      0
dtype: int64

In [29]:
df.describe()

,User_ID,Age,Height,Weight,Duration,Heart_Rate,Body_Temp,User_ID,Calories
count,1.500000e+04,15000.000000,15000.000000,15000.000000,15000.000000,15000.000000,15000.000000,1.500000e+04,15000.000000
mean,1.497736e+07,42.789800,174.465133,74.966867,15.530600,95.518533,40.025453,1.497736e+07,89.539533
std,2.872851e+06,16.980264,14.258114,15.035657,8.319203,9.583328,0.779230,2.872851e+06,62.456978
min,1.000116e+07,20.000000,123.000000,36.000000,1.000000,67.000000,37.100000,1.000116e+07,1.000000
25%,1.247419e+07,28.000000,164.000000,63.000000,8.000000,88.000000,39.600000,1.247419e+07,35.000000
50%,1.499728e+07,39.000000,175.000000,74.000000,16.000000,96.000000,40.200000,1.499728e+07,79.000000
75%,1.744928e+07,56.000000,185.000000,87.000000,23.000000,103.000000,40.600000,1.744928e+07,138.000000
max,1.999965e+07,79.000000,222.000000,132.000000,30.000000,128.000000,41.500000,1.999965e+07,314.000000

In [30]:
x = df.drop(['User_ID','Calories'],axis=1)

In [31]:
y = df['Calories']

In [32]:
from sklearn.preprocessing import LabelEncoder

In [33]:
le = LabelEncoder()

In [36]:
 df['Gender'] = le.fit_transform(df['Gender'])

In [37]:
df.head()

,User_ID,Gender,Age,Height,Weight,Duration,Heart_Rate,Body_Temp,User_ID,Calories
0,14733363,1,68,190.0,94.0,29.0,105.0,40.8,14733363,231.0
1,14861698,0,20,166.0,60.0,14.0,94.0,40.3,14861698,66.0
2,11179863,1,69,179.0,79.0,5.0,88.0,38.7,11179863,26.0
3,16180408,0,34,179.0,71.0,13.0,100.0,40.5,16180408,71.0
4,17771927,0,27,154.0,58.0,10.0,81.0,39.8,17771927,35.0

In [38]:
x = df.drop(['User_ID','Calories'],axis=1)

In [53]:
x

       Gender  Age  Height  Weight  Duration  Heart_Rate  Body_Temp
0           1   68   190.0    94.0      29.0       105.0       40.8
1           0   20   166.0    60.0      14.0        94.0       40.3
2           1   69   179.0    79.0       5.0        88.0       38.7
3           0   34   179.0    71.0      13.0       100.0       40.5
4           0   27   154.0    58.0      10.0        81.0       39.8
...       ...  ...     ...     ...       ...         ...        ...
14995       0   20   193.0    86.0      11.0        92.0       40.4
14996       0   27   165.0    65.0       6.0        85.0       39.2
14997       0   43   159.0    58.0      16.0        90.0       40.1
14998       1   78   193.0    97.0       2.0        84.0       38.3
14999       1   63   173.0    79.0      18.0        92.0       40.5

[15000 rows x 7 columns]

In [39]:
y = df['Calories']

In [40]:
from sklearn.model_selection import train_test_split

In [41]:
x_train,x_test,y_train,y_test = train_test_split(x,y, test_size = .30, random_state=2)

In [42]:
from sklearn.linear_model import LinearRegression

In [43]:
lr = LinearRegression()

In [44]:
lr.fit(x_train,y_train)

LinearRegression()

In [45]:
y_pred = lr.predict(x_test)

In [46]:
y_pred

array([137.5093396 , 182.26763251,  50.11240386, ...,  56.77246047,
        -9.71129444,  35.85740864])

In [47]:
from sklearn.metrics import mean_squared_error, mean_absolute_error, r2_score

In [48]:
print('MSE =',mean_squared_error(y_test,y_pred))

MSE = 127.5215360546466

In [49]:
print('MAE =',mean_absolute_error(y_test,y_pred))

MAE = 8.322973845600487

In [50]:
print('RMSE =',np.sqrt(mean_squared_error(y_test,y_pred)))

RMSE = 11.292543382898584

In [51]:
print('R =',r2_score(y_test,y_pred))

R = 0.967304549749165

# Predictive Model

In [54]:
lr.predict([[1,68,190.0,94.0,29.0,105.0,40.8]])

array([199.41051578])